In [2]:
lst = [23000,25000,13000,5000,30000]

In [3]:
print(*map(lambda v:v*85,lst))

1955000 2125000 1105000 425000 2550000

In [4]:
sum(map(lambda v:v*85,lst))/len(lst)

1632000.0

In [5]:
import pandas as pd

In [6]:
df = pd.DataFrame({
    "gender":["male","male","female","female","male","female","female","male"],
    "height":[170,180,165,175,160,180,160,170],
    "weight":[80,80,60,55,90,60,50,75]
})

In [7]:
df

   gender  height  weight
0    male     170      80
1    male     180      80
2  female     165      60
3  female     175      55
4    male     160      90
5  female     180      60
6  female     160      50
7    male     170      75

In [8]:
m = df[df["gender"]=="male"]
f = df[df["gender"]=="female"]

#### split

In [9]:
m

  gender  height  weight
0   male     170      80
1   male     180      80
4   male     160      90
7   male     170      75

In [10]:
f

   gender  height  weight
2  female     165      60
3  female     175      55
5  female     180      60
6  female     160      50

#### apply

In [11]:
ma = m[["height","weight"]].mean().to_list()
ma

[170.0, 81.25]

In [12]:
fa = f[["height","weight"]].mean().to_list()
fa

[170.0, 56.25]

#### combine

In [13]:
result = pd.DataFrame([fa,ma],index=["female","male"],columns=["height","weight"])

In [14]:
result

        height  weight
female   170.0   56.25
male     170.0   81.25

In [15]:
# iterator -> lazy operation
df.groupby("gender")

In [16]:
# to get output you need to apply aggregation function
df.groupby("gender").head(1)

   gender  height  weight
0    male     170      80
2  female     165      60

In [17]:
df.groupby("gender").mean()

        height  weight
gender
female   170.0   56.25
male     170.0   81.25

In [18]:
df.groupby("gender")["weight"].mean()

gender
female    56.25
male      81.25
Name: weight, dtype: float64

#### Reshape

-> Long format to wide format


-> Wide format to long format

In [20]:
df.groupby("gender").describe()
# no. of columns more than no. of rows so it is wide format

       height                                                       weight  \
        count   mean       std    min     25%    50%     75%    max  count
gender
female    4.0  170.0  9.128709  160.0  163.75  170.0  176.25  180.0    4.0
male      4.0  170.0  8.164966  160.0  167.50  170.0  172.50  180.0    4.0


         mean       std   min    25%   50%   75%   max
gender
female  56.25  4.787136  50.0  53.75  57.5  60.0  60.0
male    81.25  6.291529  75.0  78.75  80.0  82.5  90.0

In [23]:
df.groupby("gender").describe().T
# T = transpose (row-> column,column->row)
# long format

gender            female        male
height count    4.000000    4.000000
       mean   170.000000  170.000000
       std      9.128709    8.164966
       min    160.000000  160.000000
       25%    163.750000  167.500000
       50%    170.000000  170.000000
       75%    176.250000  172.500000
       max    180.000000  180.000000
weight count    4.000000    4.000000
       mean    56.250000   81.250000
       std      4.787136    6.291529
       min     50.000000   75.000000
       25%     53.750000   78.750000
       50%     57.500000   80.000000
       75%     60.000000   82.500000
       max     60.000000   90.000000

In [24]:
df.groupby("gender").agg({
    "height":"std",
    "weight":"median"
})

          height  weight
gender
female  9.128709    57.5
male    8.164966    80.0

In [25]:
df.groupby("gender").agg({
    "height":["std","min","max"],
    "weight":["mean","median"]
})

          height           weight
             std  min  max   mean median
gender
female  9.128709  160  180  56.25   57.5
male    8.164966  160  180  81.25   80.0

In [26]:
for gd in df.groupby("gender"):
    print(gd,type(gd))

('female',    gender  height  weight
2  female     165      60
3  female     175      55
5  female     180      60
6  female     160      50) <class 'tuple'>
('male',   gender  height  weight
0   male     170      80
1   male     180      80
4   male     160      90
7   male     170      75) <class 'tuple'>

In [30]:
for gender,sub_df in df.groupby("gender"):
    print(sub_df)
    print("\n")

   gender  height  weight
2  female     165      60
3  female     175      55
5  female     180      60
6  female     160      50


  gender  height  weight
0   male     170      80
1   male     180      80
4   male     160      90
7   male     170      75

In [32]:
groups = df.groupby("gender").groups
groups

{'female': [2, 3, 5, 6], 'male': [0, 1, 4, 7]}

In [33]:
df.loc[groups["female"]]

   gender  height  weight
2  female     165      60
3  female     175      55
5  female     180      60
6  female     160      50

#### Merge

In [34]:
marks = pd.DataFrame({
    "maths": [70,75,60,65],
    "phy": [90,80,70,65],
    "chem": [95,90,70,80]},
    index = [1001,1004,1006,1003])

In [35]:
marks

      maths  phy  chem
1001     70   90    95
1004     75   80    90
1006     60   70    70
1003     65   65    80

In [36]:
info = pd.DataFrame({
    "name":['A','B','C','D'],
    "gender":['male','female','female','male']
},
    index = [1001,1003,1006,1004])

In [37]:
info

     name  gender
1001    A    male
1003    B  female
1006    C  female
1004    D    male

In [38]:
pd.concat((marks,info),axis=1)

      maths  phy  chem name  gender
1001     70   90    95    A    male
1004     75   80    90    D    male
1006     60   70    70    C  female
1003     65   65    80    B  female

In [40]:
df.rename({"gender":"Sex","height":"Height","weight":"Weight"},axis=1,inplace=True)

In [41]:
df

      Sex  Height  Weight
0    male     170      80
1    male     180      80
2  female     165      60
3  female     175      55
4    male     160      90
5  female     180      60
6  female     160      50
7    male     170      75

In [42]:
A1 = pd.DataFrame({
    "gender":['female','feamle','male','female','male'],
    "salary":[40000,80000,60000,40000,20000],
    "education":['school','master','bachelor','bachelor','NA']
},
                  index = [56,78,89,100,110])

In [43]:
A1

     gender  salary education
56   female   40000    school
78   feamle   80000    master
89     male   60000  bachelor
100  female   40000  bachelor
110    male   20000        NA

In [44]:
A1.reset_index()

   index  gender  salary education
0     56  female   40000    school
1     78  feamle   80000    master
2     89    male   60000  bachelor
3    100  female   40000  bachelor
4    110    male   20000        NA

In [45]:
A1.reset_index(drop=True)

   gender  salary education
0  female   40000    school
1  feamle   80000    master
2    male   60000  bachelor
3  female   40000  bachelor
4    male   20000        NA